#include<stdio.h>
int fun(double x)
{
	int i; 
	double an=(1+0.00000000001)/(((i+1)*i)/2); //?????????? 
	for(i=10000;;i--)
		if(an=(1+0.00000000001)/(((i+1)*i)/2) > x) break;	
	int n=i+1;    //?????????????????n 
	return n;
}
int main(void)
{
	double x,an,bn;
	int i;
	scanf("%le",&x);   //?????? 
	int n=fun(x); 
	an=(1+0.00000001)/((n+1)*n/2);  //?????an
	
    bn=(1+0.00000001)/((i+1)*i/2); //?????????? 
	double sn=0;
	for(i=1;i<=n;i++) sn+=bn=(1+0.00000000001)/((i+1)*i/2);  //????????sn 
	printf("%d %.6f %.8f",n,sn,an); 
	return 0;	
}
/* 问题描述
用自定义函数，求出sn=1+1/(1+2)+....+an，期中an=1/(1+2+....+n)，分别计算an不大于10^-3 、10^-4、10^-5、 10^-6时的n、sn、an值。
输入说明
输入精度 (10^-3 、10^-4、10^-5、 10^-6)
（提示:用%le输入格式）
输出说明
输出n、sn、an的值，输出值之间用空格分隔。
输入样例
10e-6
输出样例
447 1.995536 0.00000999  */

